edgeimpulse/voice-activated-microbit/libraries/codal-nrf52/source/NRF52Pin.cpp
/*
The MIT License (MIT)

Copyright (c) 2017 Lancaster University.

Permission is hereby granted, free of charge, to any person obtaining a
copy of this software and associated documentation files (the "Software"),
to deal in the Software without restriction, including without limitation
the rights to use, copy, modify, merge, publish, distribute, sublicense,
and/or sell copies of the Software, and to permit persons to whom the
Software is furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in
all copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL
THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
DEALINGS IN THE SOFTWARE.
*/

/**
  * Class definition for Pin.
  *
  * Commonly represents an I/O pin on the edge connector.
  */
#include "NRF52Pin.h"
#include "Button.h"
#include "PulseIn.h"
#include "Timer.h"
#include "ErrorNo.h"
#include "nrf.h"
#include "EventModel.h"
#include "CodalDmesg.h"
#include "codal_target_hal.h"


using namespace codal;

#ifdef NRF_P1
#define PORT (name < 32 ? NRF_P0 : NRF_P1)
#define PIN ((name) & 31)
#define NUM_PINS 48
#else
#define PORT (NRF_P0)
#define PIN (name)
#define NUM_PINS 32
#endif

volatile uint32_t interrupt_enable = 0;

static NRF52Pin *irq_pins[NUM_PINS];

MemorySource* NRF52Pin::pwmSource = NULL;
NRF52PWM* NRF52Pin::pwm = NULL;
uint16_t NRF52Pin::pwmBuffer[NRF52PIN_PWM_CHANNEL_MAP_SIZE] = {0,0,0,0};
int8_t NRF52Pin::pwmChannelMap[NRF52PIN_PWM_CHANNEL_MAP_SIZE] = {-1,-1,-1,-1};
uint8_t NRF52Pin::lastUsedChannel = 3;

NRF52ADC* NRF52Pin::adc = NULL;
TouchSensor* NRF52Pin::touchSensor = NULL;

#ifdef __cplusplus
extern "C" {
#endif
void GPIOTE_IRQHandler(void)
{
    if (NRF_GPIOTE->EVENTS_PORT)
    {
        NRF_GPIOTE->EVENTS_PORT = 0;
        for (uint8_t i = 0; i <= 31; i++)
        {
            if (interrupt_enable & (1 << i) && irq_pins[i] && NRF_P0->LATCH & (1 << i))
            {
                uint32_t currCnf = NRF_P0->PIN_CNF[i];
                uint8_t currSense = (currCnf & GPIO_PIN_CNF_SENSE_Msk) >> GPIO_PIN_CNF_SENSE_Pos;

                // hi: latch indicates a state change... determine if we were looking for hi or lo.
                if (currSense == GPIO_PIN_CNF_SENSE_High)
                {
                    // swap!
                    NRF_P0->PIN_CNF[i] = (currCnf & ~GPIO_PIN_CNF_SENSE_Msk) | (GPIO_PIN_CNF_SENSE_Low << GPIO_PIN_CNF_SENSE_Pos);
                    irq_pins[i]->rise();
                }
                else
                {
                    // swap!
                    NRF_P0->PIN_CNF[i] = (currCnf & ~GPIO_PIN_CNF_SENSE_Msk) | (GPIO_PIN_CNF_SENSE_High << GPIO_PIN_CNF_SENSE_Pos);
                    irq_pins[i]->fall();
                }
            }
        }
        // make sure to clear everything
        NRF_P0->LATCH = 0xffffffff;
#ifdef NRF_P1
        NRF_P1->LATCH = 0xffffffff;
#endif
    }
}

#ifdef __cplusplus
}
#endif

/**
  * Constructor.
  * Create a Pin instance, generally used to represent a pin on the edge connector.
  *
  * @param id the unique EventModel id of this component.
  *
  * @param name the mbed PinName for this Pin instance.
  *
  * @param capability the capabilities this Pin instance should have.
  *                   (PIN_CAPABILITY_DIGITAL, PIN_CAPABILITY_ANALOG, PIN_CAPABILITY_AD, PIN_CAPABILITY_ALL)
  *
  * @code
  * Pin P0(DEVICE_ID_IO_P0, DEVICE_PIN_P0, PIN_CAPABILITY_ALL);
  * @endcode
  */
NRF52Pin::NRF52Pin(int id, PinNumber name, PinCapability capability) : codal::Pin(id, name, capability)
{
    this->pullMode = DEVICE_DEFAULT_PULLMODE;
    CODAL_ASSERT(name < NUM_PINS, 50);
    irq_pins[name] = this;
    this->obj = NULL;

    NRF_GPIOTE->INTENSET    = GPIOTE_INTENSET_PORT_Set << GPIOTE_INTENSET_PORT_Pos;
    NVIC_EnableIRQ  (GPIOTE_IRQn);
}

/**
  * Disconnect any attached mBed IO from this pin.
  *
  * Used only when pin changes mode (i.e. Input/Output/Analog/Digital)
  */
void NRF52Pin::disconnect()
{
    if (status & IO_STATUS_ANALOG_OUT)
    {
        // Scan the NRF52 PWM modules to determine if this pin is connected to any of them. If so,
        // disconnect from the peripheral. We scan here as there may be multiple PWM peripherals in use,
        // beyond the PWM module normally used by this class.
        for (int p = 0; p < NRF52PWM_PWM_PERIPHERALS; p++)
        {
            if (NRF52PWM::nrf52_pwm_driver[p])
            {
                NRF52PWM::nrf52_pwm_driver[p]->disconnectPin(*this);

                // If this pin was attaced to the analog funcitons in this class, clear any cached state.
                if ( NRF52PWM::nrf52_pwm_driver[p] == pwm)
                    for (int i = 0; i < NRF52PWM_PWM_CHANNELS; i++)
                        if (pwmChannelMap[i] == name)
                            pwmChannelMap[i] = -1;
            }
        }
    }

    if (adc && (status & IO_STATUS_ANALOG_IN))
    {
        NRF52ADCChannel *c = adc->getChannel(*this);

        // Release the ADC channel, and wait for it to be fully disabled before continuing.
        adc->releaseChannel(*this);
        while(c->isEnabled());
    }

    if (status & IO_STATUS_TOUCH_IN)
    {
        if (obj)
        {
            if (status & IO_STATUS_CAPACITATIVE_TOUCH)
                delete ((TouchButton*)obj);
            else
                delete ((Button*)obj);
        }
    }

    if (status & IO_STATUS_EVENT_PULSE_ON_EDGE)
        delete ((PulseIn *)obj);

    if (status & (IO_STATUS_EVENT_ON_EDGE | IO_STATUS_EVENT_PULSE_ON_EDGE | IO_STATUS_INTERRUPT_ON_EDGE))
    {
        // disconnect pin cng
        PORT->PIN_CNF[PIN] &= ~(GPIO_PIN_CNF_SENSE_Msk);
        interrupt_enable &= ~(1 << this->name);
    }

    // Reset status flags to zero, but retain preferred TouchSense and Polarity mode.
    obj = NULL;
    status &= (IO_STATUS_CAPACITATIVE_TOUCH | IO_STATUS_ACTIVE_HI);
}

/**
  * Configures this IO pin as a digital output (if necessary) and sets the pin to 'value'.
  *
  * @param value 0 (LO) or 1 (HI)
  *
  * @return DEVICE_OK on success, DEVICE_INVALID_PARAMETER if value is out of range, or DEVICE_NOT_SUPPORTED
  *         if the given pin does not have digital capability.
  *
  * @code
  * Pin P0(DEVICE_ID_IO_P0, DEVICE_PIN_P0, PIN_CAPABILITY_BOTH);
  * P0.setDigitalValue(1); // P0 is now HI
  * @endcode
  */
int NRF52Pin::setDigitalValue(int value)
{
    if (status & IO_STATUS_DIGITAL_OUT)
    {
        if (value)
            PORT->OUTSET = 1 << PIN;
        else
            PORT->OUTCLR = 1 << PIN;

