edgeimpulse/voice-activated-microbit/libraries/codal-nrf52/source/NRF52Pin.cpp
        return DEVICE_OK;
    }

    // Optimisation: Permit fast changes between digital in and digital out, given its common use case.
    // we also preserve any interrupt status, pulse measurement events etc.
    if (status & IO_STATUS_DIGITAL_IN)
    {
        PORT->PIN_CNF[PIN] |= 2;
        status &= ~IO_STATUS_DIGITAL_IN;
    }
    else
        disconnect();

    if (value)
        PORT->OUTSET = 1 << PIN;
    else
        PORT->OUTCLR = 1 << PIN;

    PORT->PIN_CNF[PIN] |= 1;

    status |= IO_STATUS_DIGITAL_OUT;

    return DEVICE_OK;
}

/**
  * Configures this IO pin as a digital input (if necessary) and tests its current value.
  *
  *
  * @return 1 if this input is high, 0 if input is LO, or DEVICE_NOT_SUPPORTED
  *         if the given pin does not have digital capability.
  *
  * @code
  * Pin P0(DEVICE_ID_IO_P0, DEVICE_PIN_P0, PIN_CAPABILITY_BOTH);
  * P0.getDigitalValue(); // P0 is either 0 or 1;
  * @endcode
  */
int NRF52Pin::getDigitalValue()
{
    // Optimisation: Permit fast changes between digital in and digital out, given its common use case.
    // we also preserve any interrupt status, pulse measurement events etc.
    if (status & IO_STATUS_DIGITAL_IN)
        return (PORT->IN & (1 << PIN)) ? 1 : 0;

    if (status & IO_STATUS_DIGITAL_OUT)
        status &= ~IO_STATUS_DIGITAL_OUT;
    else
        disconnect();

    // Enable input mode, and input buffer
    PORT->PIN_CNF[PIN] &= 0xfffffffc;

    // Record our mode, so we can optimise later.
    status |= IO_STATUS_DIGITAL_IN;

    // return the current state of the pin
    return (PORT->IN & (1 << PIN)) ? 1 : 0;
}

/**
 * Configures this IO pin as a digital input with the specified internal pull-up/pull-down configuraiton (if necessary) and tests its current value.
 *
 * @param pull one of the mbed pull configurations: PullUp, PullDown, PullNone
 *
 * @return 1 if this input is high, 0 if input is LO, or DEVICE_NOT_SUPPORTED
 *         if the given pin does not have digital capability.
 *
 * @code
 * Pin P0(DEVICE_ID_IO_P0, DEVICE_PIN_P0, PIN_CAPABILITY_BOTH);
 * P0.getDigitalValue(PullUp); // P0 is either 0 or 1;
 * @endcode
 */
int NRF52Pin::getDigitalValue(PullMode pull)
{
    setPull(pull);
    return getDigitalValue();
}
/**
 * Instantiates the components required for PWM if not previously created
 */
int NRF52Pin::initialisePWM()
{
    if (pwmSource == NULL)
    {
        pwmSource = new MemorySource();
        pwmSource->setFormat(DATASTREAM_FORMAT_16BIT_UNSIGNED);
    }

    if (pwm == NULL)
    {
        pwm = new NRF52PWM(NRF_PWM0, *pwmSource, 50);
        pwm->setStreamingMode(false);
    }

    return DEVICE_OK;
}

/**
  * Configures this IO pin as an analog/pwm output, and change the output value to the given level.
  *
  * @param value the level to set on the output pin, in the range 0 - 1024
  *
  * @return DEVICE_OK on success, DEVICE_INVALID_PARAMETER if value is out of range, or DEVICE_NOT_SUPPORTED
  *         if the given pin does not have analog capability.
  */
int NRF52Pin::setAnalogValue(int value)
{
    // //check if this pin has an analogue mode...
     if(!(PIN_CAPABILITY_ANALOG & capability))
         return DEVICE_NOT_SUPPORTED;

    // //sanitise the level value
    if(value < 0 || value > DEVICE_PIN_MAX_OUTPUT)
         return DEVICE_INVALID_PARAMETER;

    int channel = -1;

    // find existing channel
    for (int i = 0; i < NRF52PIN_PWM_CHANNEL_MAP_SIZE; i++)
        if (pwmChannelMap[i] == name)
            channel = i;

    // no existing channel found
    if (channel == -1)
    {
        initialisePWM();

        // alloc new channel by round robin allocation
        channel = (lastUsedChannel + 1) % NRF52PIN_PWM_CHANNEL_MAP_SIZE;
        pwmChannelMap[channel] = name;
        lastUsedChannel = channel;
        pwm->connectPin(*this, channel);
    }

    status |= IO_STATUS_ANALOG_OUT;

    // set new value
    pwmBuffer[channel] = (int)((float)pwm->getSampleRange() * (1 - (float)value / (float)(DEVICE_PIN_MAX_OUTPUT+1)));
    pwmSource->playAsync(pwmBuffer, NRF52PIN_PWM_CHANNEL_MAP_SIZE * sizeof(uint16_t));

    return DEVICE_OK;
}

/**
  * Configures this IO pin as an analog/pwm output (if necessary) and configures the period to be 20ms,
  * with a duty cycle between 500 us and 2500 us.
  *
  * A value of 180 sets the duty cycle to be 2500us, and a value of 0 sets the duty cycle to be 500us by default.
  *
  * This range can be modified to fine tune, and also tolerate different servos.
  *
  * @param value the level to set on the output pin, in the range 0 - 180.
  *
  * @param range which gives the span of possible values the i.e. the lower and upper bounds (center +/- range/2). Defaults to DEVICE_PIN_DEFAULT_SERVO_RANGE.
  *
  * @param center the center point from which to calculate the lower and upper bounds. Defaults to DEVICE_PIN_DEFAULT_SERVO_CENTER
  *
  * @return DEVICE_OK on success, DEVICE_INVALID_PARAMETER if value is out of range, or DEVICE_NOT_SUPPORTED
  *         if the given pin does not have analog capability.
  */
int NRF52Pin::setServoValue(int value, int range, int center)
{
    //check if this pin has an analogue mode...
    if(!(PIN_CAPABILITY_ANALOG & capability))
        return DEVICE_NOT_SUPPORTED;

    //sanitise the servo level
    if(value < 0 || range < 1 || center < 1)
        return DEVICE_INVALID_PARAMETER;

    //clip - just in case
    if(value > DEVICE_PIN_MAX_SERVO_RANGE)
        value = DEVICE_PIN_MAX_SERVO_RANGE;

    //calculate the lower bound based on the midpoint
    int lower = (center - (range / 2)) * 1000;

    value = value * 1000;

    //add the percentage of the range based on the value between 0 and 180
    int scaled = lower + (range * (value / DEVICE_PIN_MAX_SERVO_RANGE));

    return setServoPulseUs(scaled / 1000);
}

/**
  * Configures this IO pin as an analogue input (if necessary), and samples the Pin for its analog value.
  *
  * @return the current analogue level on the pin, in the range 0 - 1024, or
  *         DEVICE_NOT_SUPPORTED if the given pin does not have analog capability.
  *
  * @code
  * Pin P0(DEVICE_ID_IO_P0, DEVICE_PIN_P0, PIN_CAPABILITY_BOTH);
  * P0.getAnalogValue(); // P0 is a value in the range of 0 - 1024
  * @endcode
  */
int NRF52Pin::getAnalogValue()
{

    // //check if this pin has an analogue mode...
    if(!(PIN_CAPABILITY_ANALOG & capability))
        return DEVICE_NOT_SUPPORTED;

    // Move into an analogue input state if necessary.
    if (!(status & IO_STATUS_ANALOG_IN))
    {
         disconnect();
         status |= IO_STATUS_ANALOG_IN;
    }

    if (adc)
    {
        NRF52ADCChannel *c = adc->getChannel(*this);

        if (c)
            return c->getSample() / 16;
    }

