edgeimpulse/voice-activated-microbit/libraries/codal-nrf52/source/NRF52Pin.cpp
    return DEVICE_NOT_SUPPORTED;
}

/**
  * Determines if this IO pin is currently configured as an input.
  *
  * @return 1 if pin is an analog or digital input, 0 otherwise.
  */
int NRF52Pin::isInput()
{
    return (status & (IO_STATUS_DIGITAL_IN | IO_STATUS_ANALOG_IN)) == 0 ? 0 : 1;
}

/**
  * Determines if this IO pin is currently configured as an output.
  *
  * @return 1 if pin is an analog or digital output, 0 otherwise.
  */
int NRF52Pin::isOutput()
{
    return (PORT->DIR & (1 << PIN)) != 0 || (status & (IO_STATUS_DIGITAL_OUT | IO_STATUS_ANALOG_OUT)) != 0;
}

/**
  * Determines if this IO pin is currently configured for digital use.
  *
  * @return 1 if pin is digital, 0 otherwise.
  */
int NRF52Pin::isDigital()
{
    return (status & (IO_STATUS_DIGITAL_IN | IO_STATUS_DIGITAL_OUT)) == 0 ? 0 : 1;
}

/**
  * Determines if this IO pin is currently configured for analog use.
  *
  * @return 1 if pin is analog, 0 otherwise.
  */
int NRF52Pin::isAnalog()
{
    return (status & (IO_STATUS_ANALOG_IN | IO_STATUS_ANALOG_OUT)) == 0 ? 0 : 1;
}


/**
  * Configures this IO pin as a "makey makey" style touch sensor (if necessary)
  * and tests its current debounced state.
  *
  * Users can also subscribe to DeviceButton events generated from this pin.
  *
  * @return 1 if pin is touched, 0 if not, or DEVICE_NOT_SUPPORTED if this pin does not support touch capability.
  *
  * @code
  * DeviceMessageBus bus;
  *
  * DevicePin P0(DEVICE_ID_IO_P0, DEVICE_PIN_P0, PIN_CAPABILITY_ALL);
  * if(P0.isTouched())
  * {
  *     //do something!
  * }
  *
  * // subscribe to events generated by this pin!
  * bus.listen(DEVICE_ID_IO_P0, DEVICE_BUTTON_EVT_CLICK, someFunction);
  * @endcode
  */
int NRF52Pin::isTouched()
{
    // Maintain the last type of sensing used.
    return isTouched(status & IO_STATUS_CAPACITATIVE_TOUCH ? TouchMode::Capacitative : TouchMode::Resistive);
}


/**
  * Configures this IO pin as a "makey makey" style touch sensor (if necessary)
  * and tests its current debounced state.
  *
  * Users can also subscribe to Button events generated from this pin.
  *
  * @param mode Type of sensing to use (resistive or capacitative)
  * @return 1 if pin is touched, 0 if not, or DEVICE_NOT_SUPPORTED if this pin does not support touch capability.
  *
  * @code
  * DeviceMessageBus bus;
  *
  * Pin P0(DEVICE_ID_IO_P0, DEVICE_PIN_P0, PIN_CAPABILITY_ALL);
  * if(P0.isTouched())
  * {
  *     //do something!
  * }
  *
  * // subscribe to events generated by this pin!
  * bus.listen(DEVICE_ID_IO_P0, DEVICE_BUTTON_EVT_CLICK, someFunction);
  * @endcode
  */
int NRF52Pin::isTouched(TouchMode touchMode)
{
    //check if this pin has a touch mode...
    if(!(PIN_CAPABILITY_DIGITAL & capability))
        return DEVICE_NOT_SUPPORTED;

    // Move into a touch input state if necessary.
    TouchMode currentTouchMode = (status & IO_STATUS_CAPACITATIVE_TOUCH) ? TouchMode::Capacitative : TouchMode::Resistive;

    if ((status & IO_STATUS_TOUCH_IN) == 0 || touchMode != currentTouchMode)
    {
        disconnect();

        if (touchMode == TouchMode::Capacitative)
        {
            obj = new TouchButton(*this, *touchSensor, CAPTOUCH_DEFAULT_CALIBRATION);
            status |= IO_STATUS_CAPACITATIVE_TOUCH;
        }
        else
        {
            // Configure this pin as a digital input.
            getDigitalValue();

            // Connect to a new Button instance.
            obj = new Button(*this, id, DEVICE_BUTTON_ALL_EVENTS, ACTIVE_LOW, PullMode::None);
            status &= ~IO_STATUS_CAPACITATIVE_TOUCH;
        }

        status |= IO_STATUS_TOUCH_IN;
    }

    if (touchMode == TouchMode::Capacitative)
        return ((TouchButton *)obj)->isPressed();
    else
        return ((Button *)obj)->isPressed();
}

/**
 * If this pin is configured as a capacitative touch input, perform a calibration on the input.
 */
void NRF52Pin::touchCalibrate()
{
    if ((status & IO_STATUS_TOUCH_IN) && (status & IO_STATUS_CAPACITATIVE_TOUCH))
    {
        ((TouchButton *)obj)->calibrate();
    }
}


/**
  * Configures this IO pin as an analog/pwm output if it isn't already, configures the period to be 20ms,
  * and sets the pulse width, based on the value it is given.
  *
  * @param pulseWidth the desired pulse width in microseconds.
  *
  * @return DEVICE_OK on success, DEVICE_INVALID_PARAMETER if value is out of range, or DEVICE_NOT_SUPPORTED
  *         if the given pin does not have analog capability.
  */
int NRF52Pin::setServoPulseUs(uint32_t pulseWidth)
{
    initialisePWM();

    if (pwm->getPeriodUs() != 20000)
        pwm->setPeriodUs(20000);

    return setAnalogValue((int) (1024.0f * (float) pulseWidth / 20000.0f));
}

/**
  * Configures the PWM period of the analog output to the given value.
  *
  * @param period The new period for the analog output in microseconds.
  *
  * @return DEVICE_OK on success.
  */
int NRF52Pin::setAnalogPeriodUs(uint32_t period)
{
    if (status & IO_STATUS_ANALOG_OUT)
    {
        int oldRange = pwm->getSampleRange();
        pwm->setPeriodUs(period);

        for (int i = 0; i < NRF52PIN_PWM_CHANNEL_MAP_SIZE; i++)
        {
            float v = (float) pwmBuffer[i];
            v = v * (float)pwm->getSampleRange();
            v = v / (float) oldRange;

            pwmBuffer[i] = (uint16_t) v;
        }

        pwmSource->playAsync(pwmBuffer, NRF52PIN_PWM_CHANNEL_MAP_SIZE * sizeof(uint16_t));

        return DEVICE_OK;
    }

    return DEVICE_NOT_SUPPORTED;
}

/**
  * Configures the PWM period of the analog output to the given value.
  *
  * @param period The new period for the analog output in milliseconds.
  *
  * @return DEVICE_OK on success, or DEVICE_NOT_SUPPORTED if the
  *         given pin is not configured as an analog output.
  */
int NRF52Pin::setAnalogPeriod(int period)
{
    return setAnalogPeriodUs(period*1000);
}

/**
  * Obtains the PWM period of the analog output in microseconds.
  *
  * @return the period on success, or DEVICE_NOT_SUPPORTED if the
  *         given pin is not configured as an analog output.
  */
uint32_t NRF52Pin::getAnalogPeriodUs()
{
    if (status & IO_STATUS_ANALOG_OUT)
        return pwm->getPeriodUs();

