edgeimpulse/voice-activated-microbit/libraries/codal-nrf52/source/NRF52Pin.cpp
        case DEVICE_PIN_EVENT_NONE:
            disableEvents();
            break;

        default:
            return DEVICE_INVALID_PARAMETER;
    }

    return DEVICE_OK;
}

/**
 * Measures the period of the next digital pulse on this pin.
 * The polarity of the detected pulse is defined by setPolarity().
 * The calling fiber is blocked until a pulse is received or the specified
 * timeout passes.
 *
 * @param timeout The maximum period of time in microseconds to wait for a pulse.
 * @return the period of the pulse in microseconds, or DEVICE_CANCELLED on timeout.
 */
int
NRF52Pin::getPulseUs(int timeout)
{
    PulseIn *p;

    // ensure we're in digital input mode.
    getDigitalValue();

    if (!(status & IO_STATUS_EVENT_PULSE_ON_EDGE))
        eventOn(DEVICE_PIN_EVENT_ON_PULSE);

    p = (PulseIn *)obj;
    return p->awaitPulse(timeout);
}

/**
 * Configures this IO pin drive mode to based on the provided parameter.
 * Valid values are:
 *
 *  0 Standard '0', standard '1'
 *  1 High drive '0', standard '1'
 *  2 Standard '0', high drive '1'
 *  3 High drive '0', high 'drive '1''
 *  4 Disconnect '0' standard '1'
 *  5 Disconnect '0', high drive '1'
 *  6 Standard '0'. disconnect '1'
 *  7 High drive '0', disconnect '1'
 *
 * @param value the value to write to this pin's output drive configuration register
 */
int NRF52Pin::setDriveMode(int value)
{
    if (value < 0 || value > 7)
        return DEVICE_INVALID_PARAMETER;

    uint32_t s = PORT->PIN_CNF[PIN] & 0xfffff8ff;

    s |= (value << 8);

    PORT->PIN_CNF[PIN] = s;

    return DEVICE_OK;
}

/**
 * Configures this IO pin as a high drive pin (capable of sourcing/sinking greater current).
 * By default, pins are STANDARD drive.
 *
 * @param value true to enable HIGH DRIVE on this pin, false otherwise
 */
int NRF52Pin::setHighDrive(bool value)
{
    return setDriveMode(value ? 3 : 0);
}

/**
 * Determines if this IO pin is a high drive pin (capable of sourcing/sinking greater current).
 * By default, pins are STANDARD drive.
 *
 * @return true if HIGH DRIVE is enabled on this pin, false otherwise
 */
bool NRF52Pin::isHighDrive()
{
    uint32_t s = PORT->PIN_CNF[PIN] & 0x00000700;

    return (s == 0x00000300);
}

__attribute__((noinline))
static void get_and_set(NRF_GPIO_Type *port, uint32_t mask) {
    // 0 -> 1, only set when IN==0
    port->DIRSET = ~port->IN & mask;
}

__attribute__((noinline))
static void get_and_clr(NRF_GPIO_Type *port, uint32_t mask) {
    // 1 -> 0, only set when IN==1
    port->DIRSET = port->IN & mask;
}

int NRF52Pin::getAndSetDigitalValue(int value)
{
    uint32_t mask = 1 << PIN;

    if ((PORT->DIR & mask) == 0)
    {
        // set the value
        if (value)
            PORT->OUTSET = mask;
        else
            PORT->OUTCLR = mask;

        // pin in input mode, do the "atomic" set
        if (value)
            get_and_set(PORT, mask);
        else
            get_and_clr(PORT, mask);

        if (PORT->DIR & mask) {
            disconnect();
            setDigitalValue(value); // make sure 'status' is updated
            return 0;
        } else {

            return DEVICE_BUSY;
        }
    }

    return 0;
}

/**
 * Configures the Enables/Disables this pin's DETECT event
 * @param enable The new value of this pin's DETECT sense configuration
 * Valid values are GPIO_PIN_CNF_SENSE_Disabled, GPIO_PIN_CNF_SENSE_High, GPIO_PIN_CNF_SENSE_Low
 */
void NRF52Pin::setDetect(int enable)
{
    PORT->PIN_CNF[PIN] &= ~(GPIO_PIN_CNF_SENSE_Msk);
    PORT->PIN_CNF[PIN] |= (enable << GPIO_PIN_CNF_SENSE_Pos);
}
